cask_args appdir: '/Applications'

tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/fonts"
tap "caskroom/drivers"
tap "caskroom/versions"

brew "ag"
brew "awscli"
brew "awslogs"
brew "bash"
brew "git"
brew "mobile-shell"
brew "carthage"
brew "htop"
brew "httpie"
brew "hub"
brew "kubernetes-cli"
brew "libimobiledevice", args: ["HEAD"]
brew "lynx"
brew "goaccess"
brew "cabal-install"
brew "haskell-stack"
brew "node"
brew "p7zip"
brew "packer"
brew "python"
brew "python3"
brew "ruby"
brew "rbenv"
brew "ripgrep"
brew "tmux"
brew "openconnect"
brew "vim"
brew "wget"
brew "jq"
brew "terminal-notifier"
brew "tree"
brew "shellcheck"

cask "iterm2"
cask "dbeaver-community"
cask "kindle"
cask "dropbox"
cask "docker"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "java8"
cask "google-chrome"
cask "hex-fiend"
cask "minikube"
cask "macvim"
cask "keepassx"
cask "zoomus"
cask "visual-studio-code"
cask "spectacle"
cask "intellij-idea-ce"
cask "caskroom/fonts/font-inconsolata"
cask "caskroom/fonts/font-roboto-mono"
cask "caskroom/fonts/font-iosevka"
cask "caskroom/drivers/logitech-options"
